{
  "rivalists": {
    "title": "Rivalists",
    "description": "Ai powered fitness platform",
    "url": "https://www.rivalists.com/",
    "summary": "This React Native full-stack application integrates multiple APIs for comprehensive data enrichment, featuring custom UI animations that enhance user engagement. As the lead freelance developer, I built the entire frontend and contributed significantly to backend architecture.",
    "summary2": "The app is currently in beta testing with a select user group, receiving positive feedback on performance and design."
  },
  "portfolio": {
    "title": "Portfolio",
    "description": "This website built using astro",
    "url": "https://github.com/travislang/personal-portfolio",
    "summary": "Built with Astro, this lightning-fast portfolio site seamlessly showcases my projects and frontend expertise. The single-page design combines custom CSS and hand-crafted animations to create a distinctive visual experience that highlights both technical skill and creative vision. Explore the metrics below to see performance results.",
    "summary2": ""
  },
  "ledger": {
    "title": "Ledger",
    "description": "Full feature workout tracking",
    "url": "https://github.com/travislang/ledger-server",
    "summary": "A comprehensive fitness tracking application built with React Native that enables users to monitor and analyze their weightlifting progress with intuitive data visualization. I designed the entire UI/UX experience and engineered both frontend and backend architecture, implementing multiple libraries for robust performance.",
    "summary2": "Deployed using a professional DevOps workflow with containerized backend services hosted on AWS, ensuring scalability and reliability for growing user demands."
  },
  "intelliflix": {
    "title": "intelliflix",
    "description": "Sentiment analysis movie rankings",
    "url": "https://github.com/travislang/movie-sentiment",
    "summary": "This application uses the Twitter/X API to gather real-time user discussions about movies, feeding this data through an AI sentiment analysis algorithm to generate authentic rating scores. Movies are dynamically ranked based on audience reception, with recommendations suggesting similar titles.",
    "summary2": "Built using React Native and GraphQL, the app uses Material Design principles for a clean interface while leveraging natural language processing for real ratings."
  },
  "coindock": {
    "title": "Coindock",
    "description": "Real-time crypto monitoring",
    "url": "https://github.com/travislang/coindock",
    "summary": "A web application delivering real-time cryptocurrency price updates via WebSockets for instant market visibility. Users can seamlessly manage multiple portfolios with intuitive drag-and-drop functionality, adding or removing assets according to investment strategies",
    "summary2": "The platform integrates the Push API and service workers to deliver price alerts, notifying users of market movements even when not actively browsing — enabling informed trading decisions without constant monitoring."
  },
  "fn": {
    "title": "Field Nation",
    "description": "Field service marketplace",
    "url": "https://fieldnation.com/",
    "summary": "As a senior full-stack engineer in my primary role, I architect and implement new features while optimizing existing functionality across the entire platform. I maintain comprehensive system health through DataDog monitoring, identifying and resolving performance bottlenecks before they impact users.",
    "summary2": "Working with diverse technologies daily, I balance feature development with code quality initiatives, ensuring scalability while collaborating cross functionally to align technical solutions with business objectives."
  }
}